#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_rtgewstg-1321.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1f7a4084-41bb-4166-9ee1-dd6c13a5ee23]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b2affc5e-aaed-4191-8cf6-aabd7da3c259]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8d474eb-690d-4ff6-943b-d1f11c0df54f]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9e12c839-6ae2-44c8-a388-03fad736935e]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4f010028-c094-426d-b75e-b1a3bbf34e56]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e99b7489-51d4-4537-bb5d-5955559c1fa9]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=358cf837-d744-4111-9911-ee0b21c2a8e5]
module.keycloak_dev.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef7c68d5-5d2f-470f-835a-03b49edf6c7a]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a2ebb521-ba49-415f-a323-49323d378331]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0be288c9-3008-4b0b-9476-667997192717]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2622fe34-878b-42cc-8f07-643c7eec7a56]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d98aa55a-1cd0-4852-bf57-f4cf4b9dc0b2]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c208284e-eac3-40a8-9891-766378a7b63b]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fea3cc75-4ecb-418f-8f33-02e54a7143d0]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bfa4e54c-a49d-4d79-8eb5-e7c3e019f67e]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=23b9755d-529f-4592-ae0b-0525e6dd5165]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fddcc4fc-b5bd-407c-9018-4e8348a278ea]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ba68540d-e15d-4c70-96d3-274af865a4ba]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=023943ea-5c9b-4169-a6b3-568c77b5638e]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2dceb657-c062-4745-893b-321a5f61439d]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=54031ea8-8feb-4baf-9f01-cd0350e79c21]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f3687cf-495d-4c47-b420-ef302958b4bd]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4c265439-a0a4-4543-a5eb-0eedc9e6e09d]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f371c35-b184-435e-8750-3a4c551754bd]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=de31cad2-c65a-4c3f-b579-da9c8f6fc7e5]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=705ef65b-1002-4ffb-8567-daec3f1337fe]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ca7c8587-cb91-4e3a-b2b2-a38c096092ef]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9846f0a6-bf72-424b-a96c-016eeabcb25d]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16114c49-375c-4629-abe5-55c7872d069a]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c4d723cc-a45f-4c1e-b4dc-09c394b44904]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=caaf14f5-6e9b-4142-9f2f-119ad0fac37b]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2cb561ea-840a-4fe8-bb27-4f75eab10b08]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ab73ce-2e68-4ee8-8e7f-1eaf0062dcca]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a88a401-584d-4d51-914f-ca95b639616d]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eb2779a8-08c8-4182-a33d-0b08d2f8e9ff]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae175926-b10c-4e1e-b0d1-dca7d45e5af1]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff4b484-25ce-4a9d-b2cd-cef618846d0d]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa0b6916-1bab-4a15-915b-c4374fb4ce91]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ccd59005-c1fb-4121-955f-e9e46707277f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=39470b38-aaa9-48e5-a6e6-4f66302fcad1]
module.keycloak_dev.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6437efc7-6192-475a-97ed-c3f7666a52ad]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=111cbd3a-93b6-4663-add5-26189645bb2f]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58107528-7fc6-441f-aef4-7f8fd52bbe3b]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b7e48458-fd2a-4dd7-a07f-606ba16a6ef2]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=54145368-d807-4edb-92bc-0c262b040d6e]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b1151fa-e4d2-4619-919f-e1e2723d077f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7039c887-d63a-4a76-be19-3f1a676bfc4e]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=31a1cdaa-a51f-43dc-85cf-4c846931ce29]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17a09474-dbcb-4bf6-9b37-82d8afd0d7d3]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b8206f35-b055-4fba-ad25-1b128bf2f2dd]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc7f6a47-0e3a-4f2f-9921-1d908e2277c2]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=583325d5-1108-4dc3-a278-a11dfb024c27]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14a63c25-5444-4943-8bfa-53520c4e2861]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=88561a69-cd7d-4381-a942-2422f0d02936]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8ee461d-80a8-4027-a8dd-07573e4d4b35]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b379ada4-dfdd-42f4-818c-2ec3a92ad4a0]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e80cc7-ebf7-48b0-880e-efa628c7ee70]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=037b8cf6-6cc9-4f97-87ff-8e85e4d92193]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=511f47e4-832b-4b91-a145-5f2ef547fc90]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae3b8bb9-5ce2-462a-827a-bf7f3bb2556b]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c588df82-b227-4530-981a-e0b9a2c596e1]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a892de72-c1a4-40a4-89bf-e88adea723f2]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4c87fd52-363c-4af8-88bb-81c11752a21a]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d77e6e10-df00-4286-bf8e-2005de8276b7]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fa37be77-a688-4e85-aee1-8fc1892b12cd]
module.keycloak_dev.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2334c28a-3c4a-42f2-8731-e11176754253]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a5152ade-230c-45b8-827c-ff12b3622924]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bf7e5a27-314b-40c9-b268-097abc748999]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=624232c4-9a34-4c83-b103-21fddc209e2a]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8a263f36-6a9e-4354-b081-a65307b6f5d4]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d78b6009-272c-4300-8c40-aed74d3d3eeb]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=63344caa-d4b5-49f9-8da2-b3e04c3843d0]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1ca2c8f-9b82-4912-a92e-dcf363b8623b]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=51f4c792-44ac-4cf6-9d71-6f5e95fa7bbb]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a9d8b444-608a-4c53-80e1-f9c23747a2ec]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b63e1133-991c-4f07-9c2e-9a2d18f64e03]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af0e9163-00e3-454a-8195-134bb2eb3d50]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8bfe71a2-2e0b-4757-8351-dbd8dfe5a5a9]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ed49f5c2-0ef8-4139-988c-487aff1ace0f]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ab594d1-a6ed-41f0-8466-5b234ffcfb49]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c8ce7f6f-d5a0-4024-bff8-a9161f96eeb5]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f99f1831-b9f4-4ee9-958d-0d109eaaf757]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ef161232-e0cc-4960-ae44-26cc662473c6]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4b0632ef-ced9-41ed-888a-473fab429cf5]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89161301-45c5-4d41-860a-7315549335a8]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=31ce7dc9-f930-421f-a93e-86a0c0ead613]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=afeb995f-a519-4f19-a10b-cde7e1a40803]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c6ffacca-6e07-465c-a0f0-fca71212fb2b]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8194373f-83a9-4466-95e7-0079b180a298]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=140e35d9-4536-472a-a440-2abdd0822d11]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a5ceda21-fbcc-40e0-ab5d-97a08df2305f]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d00fe817-e89f-43b8-aeaa-4b3379ac0b29]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1c26ee4c-a5c6-4ccd-bfc0-36888f023ecc]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2abfc8ea-05f6-4aeb-b0c4-ef87535b9b83]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=51ae2f04-f5a2-4869-bdb7-e7ca5a76c8a7]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1548130c-ee12-472e-9845-4aed9abc3f9a]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0596d31b-a23a-4dce-8092-ee65020f51d2]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=debc721c-9a10-4627-a70d-ff652722f343]
module.keycloak_dev.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9f2e5973-1f40-406e-98bd-f06edfc7a4d7]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1294a75a-f919-443a-b6c4-21aec8df64f3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=58c3abf5-274a-4d78-ba65-805228c03c6e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0cd6a6d4-be26-4643-b2dc-a05bb0841e98]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf046218-5d2d-4ed0-9eb5-3e429509882a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a74c851-8d61-4c6f-a9cb-c391aae49297]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=462c309a-1e1e-49f9-ad15-0dca06081da5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6faae13d-1853-4137-a10c-4c8cd7e98719]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d0a04aa7-692f-4587-9db6-c72c3d142cd0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c37d3cfd-5c6f-4c27-9840-398c76c59ece]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dc0df537-05cc-4a02-b231-9544e3e599fa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6f0963ae-5fe1-4179-ab44-cd1a269683ef]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=698074be-0922-4eb6-b488-412f05219620]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d339be32-bd09-4291-978e-06ee0d4b9096]
module.keycloak_dev.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e94d9706-7ecd-4ab4-8f09-3b866230d416]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ec5bb8e0-d9d2-4016-b07d-efaa920b9b0c]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04a6414c-2513-4833-9d08-c25c662c9daa]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7bf5a529-7614-49cf-a235-48d7974fe5e2]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=414580c7-4ea8-43cd-882c-265ea6f990b9]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0589962d-173d-4770-a497-cdb72c488266]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9ddcb15e-e415-4fdd-9288-d8c8f090fa8a]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8dc6a5d-5371-49e4-b9ea-3084c92be48b]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9309558-1291-44fe-a0e4-d78aeb6c25c9]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2da877d4-52d6-4030-a575-825bfc356689]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=21bc362c-9a0a-4b70-8407-e2ff51ea58b7]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1a060418-f9b1-4147-8cf9-b61026f5a7cd]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=21530d66-47a3-4278-b106-a7fa54b4e22d]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7cfea54e-16cd-49ed-9b46-89c63915d19a]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e03d33e2-d02a-43eb-b8af-3b39322b8f1b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cc0263f0-9be5-4905-86af-8d7e8b62c960]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=13767fcf-97d9-4c05-b5c9-787426ec024f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e833a1-2a14-44fa-8d95-0bf7670cfeef]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b414a380-c2fc-4953-92dd-9d0cdf5a34e8]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fbbb1b9f-50f0-4b3a-a20f-f2e000b23792]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14ff3539-537a-45b8-bbe7-d17bff79b2fd]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8033fed-3496-4aaf-8af5-c4382e2ca074]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=af70a806-df72-4c9f-a6c4-0cef832e279e]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5085baad-9389-4763-b3d0-b81582d7c661]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e8b4e8af-14d3-4edf-8404-ace88ce2be54]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2b69c1a3-2c26-488c-88e9-3ad41345dcae]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4b190ce6-4b44-43a6-9df6-b8492f63bc7c]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=df9a228b-9427-49f1-8eeb-b38daa6a0427]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=78e65639-4139-4c46-b930-d21bfb7bf481]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1bf74a67-5f9a-44e2-acf4-398d92978a21]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9071cad4-008b-4ea0-bc56-6630ad7e4b15]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ddf4a5f5-be5f-44a7-b6e5-382ea1098b6a]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=21743d63-a80e-4210-9761-1366287c87e5]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=05d04a3d-a40f-4a8b-9b79-aa8879d71f08]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e269553b-c168-464f-a7dd-bc4beaad9343]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=64b386f1-04d9-47c0-9d6c-82672cf18811]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7c9737d5-668f-401b-a9d9-92bc6ce3aab3]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=313fa3d3-996f-4ae7-8b59-45eeaca7a5ee]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b769b4af-d555-4b44-aa17-99e776c10353]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=33aafe72-f21e-4325-a629-9ab2762ae58e]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=eef5f96b-719a-4a6e-801c-5ca03d650a76]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=014a20f4-7c12-447e-80d1-52b58aa01bac]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e8cf9c4-21fd-40c0-bbab-aa919486f2bf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.access_token_aud will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"       = "true"
          - "id.token.claim"           = "false"
          - "included.client.audience" = "asde-2808"
        } -> null
      - id              = "68abc6ba-494b-4190-9d71-ede180515f4a" -> null
      - name            = "access_token_aud" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-audience-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "465be8d6-1a64-4a1f-beca-592e9d30be40" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "c514ff93-f7f3-45f9-bb50-d3a4f1aa9114" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "0ad94886-6a42-4d08-b395-f9eaa8c0e059" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "asde-2808"
        } -> null
      - id              = "b4608bab-13b8-471d-a468-2b0318ece9f0" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "f08e31c2-9e02-460b-a972-5ee07aff8d90" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "de1b0aa4-9944-457e-9984-78443cb8a8d9" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth-basic" -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_asde-2808.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "PUBLIC" -> null
      - client_id                                = "asde-2808" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "eb610675-b241-4816-a458-04a877e96ef0" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "asde-2808" -> null
      - pkce_code_challenge_method               = "S256" -> null
      - realm_id                                 = "onestopauth-basic" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://a",
        ] -> null
      - web_origins                              = [
          - "+",
        ] -> null
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-with-prod-3104"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-with-prod-3104"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-with-prod-3104"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-with-prod-3104"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 8 to add, 0 to change, 8 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2880 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*